package doc

//fixme doc:
// https://www.cnblogs.com/cobbliu/archive/2013/04/02/2996333.html
//各字段的意义：
//
//Message ID	16位的消息ID标示一次正常的交互，该ID由消息请求者设置，消息响应者回复请求时带上该ID。
//QR	标示该消息是请求消息（该位为0）还是应答消息（该位为1）
//OPCODE　　　
//请求类型，目前有三类值：
//
//0  QUERY。标准查询
//
//1 IQUERY， 反向查询
//
//2 STATUS， DNS状态请求
//
//5 UPDATE, DNS域更新请求
//
//AA　　　　	只在响应消息中有效。该位标示响应该消息的域名服务器是该域中的权威域名服务器。因为Answer Section中可能会有很多域名
//TC	标示这条消息是否因为长度超过UDP数据包的标准长度512字节，如果超过512字节，该位被设置为1
//RD	是否递归查询。如果该位被设置为1，则收到请求的域名服务器会递归查询域名，需要注意的是，该位为1，域名服务器不一定会做递归查询，这取决于域名服务器是否支持递归查询。
//RA　　	在响应消息中清除并设置。标示该DNS域名服务器是否支持递归查询。
//RCODE　　
//只在响应消息中有效，标示响应消息的类型：
//
//0  成功的响应
//
//1  格式错误--域名服务器无法解析请求，因为请求消息格式错误
//
//2   服务器错误--域名服务器因为内部错误无法解析该请求
//
//3   名字错误-- 只在权威域名服务器的响应消息中有效，标示请求中请求的域不存在
//
//4   Not Implemented--域名服务器不支持请求的类型
//
//5   Refused -- 域名服务器因为策略的原因拒绝执行请求的操作。例如域名服务器不会为特定的请求者返回查询结果，或者域名服务器不会为特定的请求返回特定的数据
//
//QDCOUNT	标示请求部分的条目数
//ANCOUNT　　	标示响应部分的资源记录数。如果响应消息中没有记录，则设置为0
//NSCOUNT　　	标示权威部分的域名服务器资源记录数。如果响应消息中没有权威记录，则设置为0
//ARCOUNT　　	标示额外部分的资源记录数。