package doc

//fixme vlan

//VLAN（Virtual LAN），翻译成中文是“虚拟局域网”。
//LAN可以是由少数几台家用计算机构成的网络，也可以是数以百计的计算机构成的企业网络。
//VLAN所指的LAN特指使用路由器分割的网络——也就是广播域


//广播域，指的是广播帧（目标MAC地址全部为1）所能传递到的范围，亦即能够直接通信的范围。
//严格地说，并不仅仅是广播帧，多播帧（Multicast Frame）和目标不明的单播帧（Unknown Unicast Frame）也能在同一个广播域中畅行无阻。


//用于在二层交换机上分割广播域的技术，就是VLAN。通过利用VLAN，我们可以自由设计广播域的构成，提高网络设计的自由度。

//VLAN通过限制广播帧转发的范围分割了广播域

//在一台未设置任何VLAN的二层交换机上，任何广播帧都会被转发给除接收端口外的所有其他端口

//如果要更为直观地描述VLAN的话，我们可以把它理解为将一台交换机在逻辑上分割成了数台交换机

//VLAN生成的逻辑上的交换机是互不相通的。因此，在交换机上设置VLAN后，如果未做其他处理，VLAN间是无法通信的。


//VLAN间的通信也需要路由器提供中继服务，这被称作“VLAN间路由”。


//交换机的端口，可以分为以下两种 : 访问链接（Access Link）  汇聚链接（Trunk Link）

//让交换机间互联的网线集中到一根上，这时使用的就是汇聚链接（Trunk Link）。
//汇聚链接（Trunk Link）指的是能够转发多个不同VLAN的通信的端口。
//汇聚链路上流通的数据帧，都被附加了用于识别分属于哪个VLAN的特殊信息。
//汇聚链路上流通着多个VLAN的数据，自然负载较重。因此，在设定汇聚链接时，有一个前提就是必须支持100Mbps以上的传输速度。

//fixme vlan tag
//IEEE802.1Q所附加的VLAN识别信息，位于数据帧中“发送源MAC地址”与“类别域（Type Field）”之间。具体内容为2字节的TPID和2字节的TCI，共计4字节。
//在数据帧中添加了4字节的内容，那么CRC值自然也会有所变化。这时数据帧上的CRC是插入TPID、TCI后，对包括它们在内的整个数据帧重新计算后所得的值。
//而当数据帧离开汇聚链路时，TPID和TCI会被去除，这时还会进行一次CRC的重新计算。
//基于IEEE802.1Q附加的VLAN信息，就像在传递物品时附加的标签。因此，它也被称作“标签型VLAN（Tagging VLAN）”
